Autodesk.Revit.DB.Architecture.TopographySurface.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary{System.Int32,Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Collections.Generic.IList{System.Int32}})
Creates a new topography surface element from facets and adds it to the document.
Remarks:
The document will be regenerated during the creation of this topography surface element.
document:
The document to be modified.
pointsMap:
All vertex points.
Each point maps to an integer index.
facets:
Triangle faces composing a polygon mesh.
Every facet contains 3 integer representing vertex indecs.
Returns:
The new topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.Architecture.TopographySurface.ChangePointsElevation(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Double)
Changes the elevation value for points
Remarks:
If none of the points in the collection doesn's exist, an exception will be thrown.
This function ignores input points that do not exist, unless all of the input points do not exist, which will result in an exception.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
points:
The points to be modified.
elevationValue:
The new elevation value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for elevationValue must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
-or-
None of the input points exists in the current TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.ChangePointElevation(Autodesk.Revit.DB.XYZ,System.Double)
Changes the elevation value for a point.
Remarks:
If the point doesn's exist in the current TopographySurface, an exception will be thrown.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
point:
The point to be modified.
elevationValue:
The new elevation value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point does not exist in the current topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for elevationValue must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.MovePoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.XYZ)
Moves a collection of points in a topography surface by a designated vector.
Remarks:
The points which don't exist in the current TopographySurface will be ignored.
This function ignores input points that do not exist, unless all of the input points do not exist, which will result in an exception.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
movedPoints:
The points to be moved.
moveVector:
The vector which describes the distance and direction for the move.
Note that the Z value represents a change in elevation, pass Z=0 to move the point without changing the elevation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
-or-
None of the input points exists in the current TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.MovePoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Moves a point in a TopographySurface to a new designated location.
Remarks:
If targetPt exists, the movedPt will be deleted. That means if movedPoint is moved to become a duplicate of an existing
point, movedPoint will be deleted instead becuase both points cannot exist at the same location.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
movedPoint:
The point to be moved.
targetPoint:
The new designated location of this point will move to.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point does not exist in the current topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.DeletePoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Deletes points from a Topography surface.
Remarks:
Points will be deleted if they matched in XY.
This function ignores input points that do not exist, unless all of the input points do not exist, which will result in an exception.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
points:
A collection of points to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The topography surface is not editable.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
-or-
None of the input points exists in the current TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.AddPoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Adds points to a topography surface.
Remarks:
If an input point already exists in the surface at the same XY location, the point will not be added.
The document will be regenerated by this function.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
points:
A collection of points to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
-or-
One or more points shared the same XY location (even with different elevations). This is not permitted for topography surfaces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The topography surface is not editable.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.

Autodesk.Revit.DB.Architecture.TopographySurface.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new topography surface element and adds it to the document.
Remarks:
The document will be regenerated during the creation of this topography surface element.
document:
The document to be modified.
points:
A collection of points.
The points represent an enclosed area in the XY plane.
There can be only one point in the same XY location.
Returns:
The new topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
-or-
There were not enough points to form a valid region (at least 3 are required), or the points were collinear ignoring elevation.
-or-
One or more points shared the same XY location (even with different elevations). This is not permitted for topography surfaces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014